; domain
(define (domain grid)
(:requirements :strips :constraints)
(:predicates (pred_12 ?v5 ?v11)
             (pred_7 ?v7 ?v9)
             (pred_4 ?v5 ?v9)
             (pred_5 ?v1 ?v5 )
	     (pred_8 ?v5)
             (pred_10 ?v13)
             (pred_9 ?v7)
             (pred_6 ?v9)
             (pred_2 ?v5)
             (pred_3 ?v7)
             (pred_11 ?v5)
             (pred_1 ))



(:action op_2
:parameters (?v3 ?v8 ?v2 ?v10)
:precondition (and (pred_10 ?v3) (pred_10 ?v8) (pred_9 ?v2) (pred_6 ?v10)
          (pred_12 ?v3 ?v8) (pred_7 ?v2 ?v10)
                   (pred_4 ?v8 ?v10) (pred_8 ?v3) 
                   (pred_2 ?v8) (pred_3 ?v2))
:effect (and  (pred_11 ?v8) (not (pred_2 ?v8))))


(:action op_1
:parameters (?v3 ?v4)
:precondition (and (pred_10 ?v3) (pred_10 ?v4)
               (pred_8 ?v3) (pred_12 ?v3 ?v4) (pred_11 ?v4))
:effect (and (pred_8 ?v4) (not (pred_8 ?v3))))

(:action op_5
:parameters (?v3 ?v2)
:precondition (and (pred_10 ?v3) (pred_9 ?v2) 
                  (pred_8 ?v3) (pred_5 ?v2 ?v3) (pred_1 ))
:effect (and (pred_3 ?v2)
   (not (pred_5 ?v2 ?v3)) (not (pred_1 ))))


(:action op_3
:parameters (?v3 ?v6 ?v12)
:precondition (and (pred_10 ?v3) (pred_9 ?v6) (pred_9 ?v12)
                  (pred_8 ?v3) (pred_3 ?v12) (pred_5 ?v6 ?v3))
:effect (and (pred_3 ?v6) (pred_5 ?v12 ?v3)
        (not (pred_3 ?v12)) (not (pred_5 ?v6 ?v3))))

(:action op_4
:parameters (?v3 ?v2)
:precondition (and (pred_10 ?v3) (pred_9 ?v2) 
                  (pred_8 ?v3) (pred_3 ?v2))
:effect (and (pred_1 ) (pred_5 ?v2 ?v3) (not (pred_3 ?v2)))))

; problem
(define (problem grid-3-3-2-2-2)
    (:domain grid)
    (:objects
    obj_13 obj_02 obj_07 obj_10 obj_03 obj_08 obj_06 obj_09 obj_04
    obj_12 obj_11
    obj_01 obj_05
    )

    (:init
       (pred_1)

       (pred_10 obj_13)
       (pred_10 obj_02)
       (pred_10 obj_07)
       (pred_10 obj_10)
       (pred_10 obj_03)
       (pred_10 obj_08)
       (pred_10 obj_06)
       (pred_10 obj_09)
       (pred_10 obj_04)
       (pred_6 obj_12)
       (pred_6 obj_11)
       (pred_9 obj_01)
       (pred_9 obj_05)

       (pred_12 obj_13 obj_10)
       (pred_12 obj_13 obj_02)
       (pred_12 obj_02 obj_03)
       (pred_12 obj_02 obj_07)
       (pred_12 obj_02 obj_13)
       (pred_12 obj_07 obj_08)
       (pred_12 obj_07 obj_02)
       (pred_12 obj_10 obj_06)
       (pred_12 obj_10 obj_03)
       (pred_12 obj_10 obj_13)
       (pred_12 obj_03 obj_09)
       (pred_12 obj_03 obj_08)
       (pred_12 obj_03 obj_02)
       (pred_12 obj_03 obj_10)
       (pred_12 obj_08 obj_04)
       (pred_12 obj_08 obj_07)
       (pred_12 obj_08 obj_03)
       (pred_12 obj_06 obj_09)
       (pred_12 obj_06 obj_10)
       (pred_12 obj_09 obj_04)
       (pred_12 obj_09 obj_03)
       (pred_12 obj_09 obj_06)
       (pred_12 obj_04 obj_08)
       (pred_12 obj_04 obj_09)
       (pred_2 obj_06)
       (pred_2 obj_10)
       (pred_4  obj_06 obj_12)
       (pred_4  obj_10 obj_11)
       (pred_11 obj_13)
       (pred_11 obj_02)
       (pred_11 obj_07)
       (pred_11 obj_03)
       (pred_11 obj_08)
       (pred_11 obj_09)
       (pred_11 obj_04)

       (pred_7  obj_01 obj_12)
       (pred_7  obj_05 obj_11)
       (pred_5 obj_01 obj_03)
       (pred_5 obj_05 obj_07)
       (pred_8 obj_04)
    )

    (:goal (and
       (pred_5 obj_01 obj_07)
    ))
(:constraints
  (always (not (pred_8 obj_08)))
)
)

; plan
1. (op_1 obj_04 obj_09)
   deleted: (pred_8 obj_04)
   added: (pred_8 obj_09)
   goals met: 0 of 1
2. (op_1 obj_09 obj_03)
   deleted: (pred_8 obj_09)
   added: (pred_8 obj_03)
   goals met: 0 of 1
3. (op_5 obj_03 obj_01)
   deleted: (pred_5 obj_01 obj_03) (pred_1)
   added: (pred_3 obj_01)
   goals met: 0 of 1
4. (op_1 obj_03 obj_02)
   deleted: (pred_8 obj_03)
   added: (pred_8 obj_02)
   goals met: 0 of 1
5. (op_1 obj_02 obj_07)
   deleted: (pred_8 obj_02)
   added: (pred_8 obj_07)
   goals met: 0 of 1
6. (op_3 obj_07 obj_05 obj_01)
   deleted: (pred_3 obj_01) (pred_5 obj_05 obj_07)
   added: (pred_3 obj_05) (pred_5 obj_01 obj_07)
   goals met: 1 of 1
